{
   "py/object":"app.src.app.domain.model.class_material.ClassMaterial",
   "id":"f7fa595a-6769-4f5c-8f62-110fb8e724be",
   "courseId":null,
   "objectiveId":null,
   "materialId":null,
   "materialType":"Video",
   "transcript":" Eu sou um estudo programador, entrando a empresa muito grande, como Google, Amazon, Facebook, Netflix, Apple, Twitter. E essa empresa tem uma coisa incomum, que todas elas cobram uma entrevista técnica que envolve normalmente um quadro e branco. E esse quadro e branco vai ter um entrevistador que vai solicitar para fazer um algoritmo sobre um problema específico. E essa é definitivamente a esquivo mais cobrada pelo secretador de Big Text e em presa em transidade geral. Todos os desafios é código que você vai fazer para empresas estrangeiras, vão te cobrar conhecimento aprofundado em duas coisas, surpreendidados e algoritmas. E esse é um conhecimento que é pouco aprofundado em cursos online e tecnologias que você vai estudar por mercado. Então, com isso o que eu quero de falar é o seguinte, se você tem o desejo de se destacar dos mais concorrentes, se você tem o desejo de passar nas entrevistas técnicas, foque nesse dois pontos, os surijidades e algoritmas. E isso é muito importante. E quando eu vejo grandes programadores e programadores muito bons, todos eles têm esse consequcimento muito bem consolidado de como lidar com dados maneleficientes e otimizada, porque a medida que suas aplicações escala é muito importante que você tenha um código sustentável para lidar com inputs de milhões de dados, de centenas de milhares de dados e sem o conhecimento apropriado de algoritmos e frigidados isso não é possível. Então, esse é um conhecimento que eu tenho certeza que vai te dar muita base para implementar outras coisas, para implementar suas próprias soluções e para que você se torne um programador mais maduro para entender também o que está rolando por trás dos frameworks, que no geral todos eles implementam de maneira muito otimizada e já testada por um milhawn de senares diferentes, essas algoritmas e estúrgidas. E por que eu acho importante esses assuntos até um tempo atrás eu tinha um certo preconceito, um lidar com entender, porque essas empresas grandes cobravam esses tipos de testes para você entrar nela, porque querendo não, no dia a dia a gente não acaba usando eles, a gente acaba não tendo esse contato direto com essas estruturas, só que quando a gente vai falar de Big Tech, a gente acaba envolvendo um escopo muito maior e muito grande, então a gente acaba tendo que considerar um pouco o tamanho de usuários de cor à aplicação e eu tive um site conversando na verdade com um dos engenheiros da Google, e ele estava me contando sobre uma das soluções que a Google Cloud Platforms de Cp oferece, que lida com um trilhão de requests de uma mensajeria por hora de ser demingado. E ele concluiu esse relato falando como você quer que a gente aceite um cara na Google que não consegue escrever um algoritme, um quadro branco. Depois daí eu senti muita necessidade de me aprofundar nisso, eu também também por isso que eu acho importante você seguir uma carreira acadêmica pelo menos por algum tempo. Não estou falando que terminar o curso seja melhor solução, mas pelo menos esse nisso do curso, o ciclo básico, talvez seja um ótimo momento para você aprender isso. E claro que você não precisa fazer uma graduação formal, não precisa ir para uma faculdade ou para um bacharelário e para um tecnólogo para aprender esses assuntos, e para isso eu quero te mostrar algumas estratégias que você pode usar para quem sabe aprender isso de uma forma independente. Primeiro, eu devido a esse livro aqui, que eu curto para a Caramba, que eu tenho no algoritmos. Esse livro foi escrito pela Aditya Pargava, e ele é um livro muito fero, porque ele te mostra de maneira ilustrada e bem animada sobre como os algoritmos funcionam. Claro que ele não é um livro tão profundado, um livro para iniciantes, ela mesmo fala que não é um livro para programadores e outros curiosos, então não espere um conteúdo tão aprofundado, mas espere ele um conteúdo que vai te dar base para você começar a entender os conceitos mais difíceis nesse tópico. E outra ferramenta que eu posso te comendar é o Liquid, que é um site para treinar algoritmos e problemas de lógicos e curiosidades, outro deles é o Hacker Hanks, que segue a mesma lógica e outro é o Code Force. Então vou te acompanhar esse 3 sites também para você treinar esses problemas, e eles são interessantes porque a maior parte das entrevistas técnicas hoje, depois da pandemia, são feitas nesse sites. O pelo menos as pessoas avaliam sobre o seu site para ver quanto você já fez lá, para saber se você é um vídeo para a lago ou não, se você tem essas competências nesse assunto que são tão desigados no mercado gingo. E outra ferramenta que eu posso te dar é você participar de Hakatons, que acaba que o treinamento vai envolver todo esse processo de participar de vitro de colo de ler livros, e é o último recurso que também é muito importante que eu arabei a gente lembrar que é o Cess50, que é o curso de Harvard, do Sons 20 horas do Mingano de Computação, então é algumas lecture de ciência e computação de Harvard e gratuitos na internet, que é também um excelente caminho para você começar a sua tilha nesse má, conhecimento, que pode ser um pouquinho profundo demais, mas que com certeza você consegue achar seu caminho dele, tá? E afinal, o que são os estudos de dados e algoritmos? Algoritmos da definição técnica dele é uma sequência de passos para terminar uma tarefa específica, então você tem um problema específico, você tem que dar uma sequência de instruções para computador para ele determinado, para ele executar esse taref, e te dar um resultado desejado, certo? Isso do judiado é basicamente a maneira como a gente organiza os nossos dados na aplicação, então como você quer disponibilizar os seus dados presoários, como você quer armazenar esses dados, então você tem conhecimento disso, vai fazer com que você consiga desenvolver o código mais os mesados, melhores, mais bonitos que podem ser mais e que podem ser reutilizados ao longo da aplicação, demorou? Então, esse é o papo que eu tive para falar hoje sobre algoritmos os seus dados, espero que seja proveitoso para você, pega essa visão um pouco mais aprofundada do porquê isso dá isso, porque não é um modo bagem, apesar de você não praticamente nunca usar isso no mercado de trabalho, mas vai lá apenas conversa, eu vou ver o que estamos juntos, dois ou dois ou três alcione, espero que você consiga o seu logo, estou contigo nessa, e é nós!"
}